[{
	"id": "9063",
	"datetime": "2016-01-05 14:53:24",
	"PraiseUser_id": "816",
	"region_start": "125867.808843",
	"region_end": "126122.03647420567",
	"title": "good interaction"
}, {
	"id": "9064",
	"datetime": "2016-01-05 14:59:07",
	"PraiseUser_id": "796",
	"region_start": "9145.421828393135",
	"region_end": "12096.390489859594",
	"title": "It returned to the repeated note thing at the end"
}, {
	"id": "9065",
	"datetime": "2016-01-05 15:00:02",
	"PraiseUser_id": "816",
	"region_start": "0",
	"region_end": "215076.576",
	"title": "Shape of the piece felt strong with more activity in the middle and the solitary repeated note at the end repeated by saxophone and computer with wider and wider spaces until the final note felt a good way to end."
}, {
	"id": "9066",
	"datetime": "2016-01-05 15:00:32",
	"PraiseUser_id": "796",
	"region_start": "32538.08594071763",
	"region_end": "44488.21850858034",
	"title": "It has a kind of reset function that causes it to forget your patterns occasionally "
}, {
	"id": "9067",
	"datetime": "2016-01-05 15:02:01",
	"PraiseUser_id": "796",
	"region_start": "104023.79616848673",
	"region_end": "110381.71407176286",
	"title": "It doesn't pay much attention to timbre"
}, {
	"id": "9068",
	"datetime": "2016-01-05 15:03:13",
	"PraiseUser_id": "796",
	"region_start": "121161.78326365055",
	"region_end": "127261.59895163807",
	"title": "It lead you here, which was quite rare I think. "
}, {
	"id": "9071",
	"datetime": "2016-01-05 15:05:56",
	"PraiseUser_id": "816",
	"region_start": "36013.578987",
	"region_end": "36267.80661820567",
	"title": "The beginning felt like I was experimenting with different length phrases and intervals to see how the computer would respond. As if playing with a new human player for the first time in an improvising situation."
}, {
	"id": "9072",
	"datetime": "2016-01-05 15:06:24",
	"PraiseUser_id": "796",
	"region_start": "138187.92606552262",
	"region_end": "162346.29341653665",
	"title": "Nice interplay in this section"
}, {
	"id": "9073",
	"datetime": "2016-01-05 15:07:53",
	"PraiseUser_id": "796",
	"region_start": "162595.792224649",
	"region_end": "179733.77931981278",
	"title": "I think that the forgetting function did not trigger in this section so it was playing back from a previous memory"
}, {
	"id": "9074",
	"datetime": "2016-01-05 15:08:55",
	"PraiseUser_id": "796",
	"region_start": "178615.3363868955",
	"region_end": "194221.91700468017",
	"title": "It is back in responsive mode here - it has forgotten the earlier patterns and is picking up on the most recent input"
}, {
	"id": "9075",
	"datetime": "2016-01-05 15:09:28",
	"PraiseUser_id": "816",
	"region_start": "49926.470950999996",
	"region_end": "50180.69858220567",
	"title": "I tried a very tonal simple melodic motivic phrase in several keys and liked the way the computer responded."
}, {
	"id": "9076",
	"datetime": "2016-01-05 15:09:56",
	"PraiseUser_id": "796",
	"region_start": "24123.953722308892",
	"region_end": "34293.181004680184",
	"title": "Nice how you paused in the middle of this section"
}, {
	"id": "9077",
	"datetime": "2016-01-05 15:12:01",
	"PraiseUser_id": "796",
	"region_start": "53865.93233073323",
	"region_end": "62004.75551950079",
	"title": "This section works well as the similarity between its patterns and your patterns is quite clear, but it is not simply mimicking. "
}, {
	"id": "9078",
	"datetime": "2016-01-05 15:13:39",
	"PraiseUser_id": "816",
	"region_start": "74737.985827",
	"region_end": "74992.21345820568",
	"title": "I then tried another different idea which was repeated but with much wider intervals on the saxophone from the top to the bottom of the horn and with space between the notes and the computer and myself almost got into a rhythmic groove together."
}, {
	"id": "9079",
	"datetime": "2016-01-05 15:14:11",
	"PraiseUser_id": "796",
	"region_start": "80106.88483884516",
	"region_end": "82684.88707501572",
	"title": "As I zoom in I find more interesting details! Here we have an interesting mimic effect "
}, {
	"id": "9080",
	"datetime": "2016-01-05 15:16:56",
	"PraiseUser_id": "796",
	"region_start": "121764.02176599063",
	"region_end": "128879.03950078003",
	"title": "Here the algorithm leads Martin"
}, {
	"id": "9081",
	"datetime": "2016-01-05 15:18:34",
	"PraiseUser_id": "796",
	"region_start": "148460.39423400935",
	"region_end": "168798.84879875195",
	"title": "I think by this stage that I wanted the algorithm to come up with a  new interaction mode. "
}, {
	"id": "9082",
	"datetime": "2016-01-05 15:19:49",
	"PraiseUser_id": "796",
	"region_start": "172610.15817784713",
	"region_end": "191176.3108642746",
	"title": "It felt as if you were trying to calm the algorithm here. "
}, {
	"id": "9083",
	"datetime": "2016-01-05 15:20:17",
	"PraiseUser_id": "796",
	"region_start": "180490.87915132605",
	"region_end": "191176.3108642746",
	"title": "It picks up on the calm down message now I think"
}, {
	"id": "9084",
	"datetime": "2016-01-05 15:21:16",
	"PraiseUser_id": "816",
	"region_start": "109919.44577699999",
	"region_end": "110173.67340820565",
	"title": "Next were some faster longer lines by myself and repeating briefly a short chromatic motive, tiny bit of wildness and finishing with a multiphonic (two notes produced at the same time on the horn). computer responded by picking the strongest note in the multi phonic and then there was space. This felt like it was the end of another movement in the piece. Lots of short movements."
}, {
	"id": "9085",
	"datetime": "2016-01-05 15:21:32",
	"PraiseUser_id": "796",
	"region_start": "137448.03304836195",
	"region_end": "142283.14788143526",
	"title": "The algorithm is really complementary here "
}, {
	"id": "9086",
	"datetime": "2016-01-05 15:22:57",
	"PraiseUser_id": "796",
	"region_start": "22523.719987519504",
	"region_end": "30912.041984399373",
	"title": "I wonder what you are both thinking going into this section. The algorithm not a lot I suspect! Otherwise it would play notes. "
}, {
	"id": "9087",
	"datetime": "2016-01-05 15:25:55",
	"PraiseUser_id": "796",
	"region_start": "134492.222195649",
	"region_end": "137708.8082771126",
	"title": "When the algorithm starts a riff, it has high `energy', which reduces as the riff continues. "
}, {
	"id": "9088",
	"datetime": "2016-01-05 15:25:59",
	"PraiseUser_id": "816",
	"region_start": "118813.05310452418",
	"region_end": "119226.01664898597",
	"title": "This moment made me feel that sometimes I want the computer to set something up for me to play against first rather than only responding to me which is what it seems to do."
}, {
	"id": "9089",
	"datetime": "2016-01-05 15:29:29",
	"PraiseUser_id": "796",
	"region_start": "45916.38409984399",
	"region_end": "56842.71121372855",
	"title": "Good pace in this section. "
}, {
	"id": "9090",
	"datetime": "2016-01-05 15:30:27",
	"PraiseUser_id": "796",
	"region_start": "62693.028093603745",
	"region_end": "76931.66697035881",
	"title": "The algorithm picks up well on the rhythm here. "
}, {
	"id": "9091",
	"datetime": "2016-01-05 15:32:06",
	"PraiseUser_id": "816",
	"region_start": "161844.496242",
	"region_end": "162098.72387320566",
	"title": "Lots of activity and faster urgent phrases from myself and great responses from the computer which feels like the climax of the piece."
}, {
	"id": "9092",
	"datetime": "2016-01-05 15:32:07",
	"PraiseUser_id": "796",
	"region_start": "98600.26974975485",
	"region_end": "103481.78151638065",
	"title": "Not sure why the algorithm plays this long note here. Possibly a memory reset followed by small input to which is responds. "
}, {
	"id": "9093",
	"datetime": "2016-01-05 15:33:17",
	"PraiseUser_id": "796",
	"region_start": "206937.75281123244",
	"region_end": "215076.576",
	"title": "Feels that perhaps the artificial nature of the algorithm is very clearly revealed at the end. "
}, {
	"id": "9094",
	"datetime": "2016-01-05 15:34:52",
	"PraiseUser_id": "796",
	"region_start": "12457.73359126365",
	"region_end": "26188.771444617785",
	"title": "An interesting opening to the piece, with the interplay of tempo. "
}, {
	"id": "9095",
	"datetime": "2016-01-05 15:36:56",
	"PraiseUser_id": "816",
	"region_start": "214680.8192698908",
	"region_end": "215076.576",
	"title": "I like the ending over the last 30 seconds, in how I slowed down my activity to the one long held note with the computer repeating it as separate notes until it seemed to give up realising I had finished playing! The audience felt like they were really with me\/us in the moment too with their laughter at the end."
}, {
	"id": "9096",
	"datetime": "2016-01-06 10:53:31",
	"PraiseUser_id": "786",
	"region_start": "24.2948",
	"region_end": "278.52243120567374",
	"title": "This is the correct one to annotate, Mark! "
}, {
	"id": "9098",
	"datetime": "2016-01-10 12:19:14",
	"PraiseUser_id": "790",
	"region_start": "2030.404093603744",
	"region_end": "4963.025083291756",
	"title": "The sax player's line here seems to be a tentative, curious and hopeful reaching out to his musical partner for the performance. Im amazed that the CMA (short for computational music agent or algorithm - someone else can decide). Actually synchronises on the 4th note. Probably chance but it works! And it feels like it might even be real musical synergy!  "
}, {
	"id": "9099",
	"datetime": "2016-01-10 12:28:00",
	"PraiseUser_id": "790",
	"region_start": "5334.1124492979725",
	"region_end": "14790.131077172198",
	"title": "Another 4 note phrase from the sax. Which the CAM responds to. Interestingly the response from the CAM is played over by the Sax. It sounds like the second part of the sax phrase was intended at the beginning of this section. The single note from the CAM works really well because it seems to free up the sax to become more confident to let go. And again the system is very sensitive in only playing a two note phrase which suggests it is really \"listening\" to the \"musical intent\" of the sax.  "
}, {
	"id": "9100",
	"datetime": "2016-01-10 12:30:38",
	"PraiseUser_id": "790",
	"region_start": "15511.943138845554",
	"region_end": "36220.02724996962",
	"title": "This is really interesting now. Because the roles are reversed. It seems like the CAM is suggesting some open, curious phrases to the human. The fact there are 3 with real gaps gives a real sense of musical autonomy to the system as I listen to it. Then after the 3rd statement from the CAM there is a large intriguing gap which gives time for the sax to play."
}, {
	"id": "9101",
	"datetime": "2016-01-10 12:33:57",
	"PraiseUser_id": "790",
	"region_start": "25423.068205928237",
	"region_end": "36211.7408049922",
	"title": "After the gap the sax plays. And what is nice is that the accompaniment is again sparse. And again the CAM has the sensitivity to wait for the sax to finish the phrase before it starts its own line of soloing. This awareness is extremely important to get the sense of a real emerging conversation between the 2 instruments. But then the sax comes in almost as soon as the system has finished its line. Were there any visuals from the machine I couldnt help wondering!  Again I love the fact that there are only 2 notes from the CAM right at the end of the line. One of the things which is interesting is whether this taking the human musician into new areas of \"sensitivity\/responsiveness\" in trying to work with the CAM. Are they playing and interacting in new ways? "
}, {
	"id": "9102",
	"datetime": "2016-01-10 12:38:36",
	"PraiseUser_id": "790",
	"region_start": "36510.818902197585",
	"region_end": "56773.88395631825",
	"title": "Rather extraordinary again the interplay here. There feels like real interaction that is happening with both sax and CAM taking an equal responsibility to give the other instrument space, to response to what the other instrument is doing, to be aware of the unfolding musical journey, and to take responsibility for offering ideas. What is key for this to work as a listener are all of these attributes. I love the way that neither instrument wants to dominate! "
}, {
	"id": "9103",
	"datetime": "2016-01-10 12:43:03",
	"PraiseUser_id": "790",
	"region_start": "56980.36572854914",
	"region_end": "69687.59812792511",
	"title": "This is really interesting too because the sax player is playing with a repeated (with some variations) basic idea of a rapidly descending phrase. On the first time the system responds almost through imitation. On the second time you are expecting something similar as a listener but almost comically the CAM does something completely different. Almost irreverential! On the 3rd time it does nothing and so there is a gap. Gas are so important to let the listener have time to impose a sense of \"collaborative performing agency\" on the improvising systems. And then after the space ... which is quite comical .... the CAM starts things off this time. Then towards the end they are both paying together which suggests both systems feel \"confident\" in the unfolding musical journey.&nbsp;"
}, {
	"id": "9104",
	"datetime": "2016-01-10 12:47:11",
	"PraiseUser_id": "790",
	"region_start": "69937.09693603743",
	"region_end": "76961.04809283814",
	"title": "Its great how the CAM seems to provoke the sax at the start of this passage. The synchronicity is really impressive and I can imagine how this might work if we could find ways of manifesting the musical autonomy of the CAM in visual ways. "
}, {
	"id": "9105",
	"datetime": "2016-01-10 12:50:21",
	"PraiseUser_id": "790",
	"region_start": "76901.74690889637",
	"region_end": "82350.47922166396",
	"title": "I love the single emphasised note from the CAM. It seems to recognise there's going to be a bit of a long forceful phrase form the sax and just give a nice strong push to it. Again its great how when the system finishes its phrase the CAM responds with a double note. Almost saluting the sax playing. Again the comical elements of this come across strongly. It feels like \"fun\" to play with the CAM, and to hear how the human sax player copes by being in this situation. I think exploiting the potential fun would make for good theatre! "
}, {
	"id": "9106",
	"datetime": "2016-01-10 12:53:29",
	"PraiseUser_id": "790",
	"region_start": "83599.30753198128",
	"region_end": "107241.4704524181",
	"title": "Again this is great because of the changing roles. At first the sax is clearly taking the lead and the CAM is responding and \"playing along\" in more of a supporting\/responsive role. The CAM seems completely aware though of when the sax has come to the end and only after a very short pause takes over a much stronger leadership role. The sax then recognise this and allows the CAM to take on a stronger leadership role. One of the things again which is striking as a listener is whether the sax payer has to be \"even more sensitive\" in this duo situation that if they were playing with another human musician. I think that comes across in the playing and the performance but it would be good to hear what the sax player thinks!"
}, {
	"id": "9107",
	"datetime": "2016-01-10 13:00:21",
	"PraiseUser_id": "790",
	"region_start": "87014.86018096724",
	"region_end": "109873.04515074732",
	"title": "This next passage has the CAM in listening mode and just interspersing the ongoing performance with a note her and a phrase were. It's so important to allow the human sax some autonomy here ... the fact that the CAM is only exerting autonomy every now and then seems to be part of the key as to why this performance works musically and as genuine \"musical dialogue\". Then after a pause the system kicks off again and take over the leadership role. This changing of roles is really important and having both systems being able to play both roles well (creator\/responder) is key to making this work."
}, {
	"id": "9108",
	"datetime": "2016-01-10 13:01:25",
	"PraiseUser_id": "790",
	"region_start": "106837.11031513261",
	"region_end": "129188.76215912637",
	"title": "Use of space so important here. "
}, {
	"id": "9109",
	"datetime": "2016-01-10 13:04:34",
	"PraiseUser_id": "790",
	"region_start": "129188.76215912636",
	"region_end": "156091.5874907715",
	"title": "Now a genuine conversation with no-one taking the lead. Right at the send of this commented section is a very funny note from the CAM. Like a \"laugh\" in the middle of the conversation. Again I hear a lot of humour in this performance. "
}, {
	"id": "9110",
	"datetime": "2016-01-10 13:07:30",
	"PraiseUser_id": "790",
	"region_start": "161289.66878104914",
	"region_end": "171915.86917251663",
	"title": "It works well when a particular motif is used by the sax and then repeated. Here we hear there very high notes which the CAM seems to \"hear\" and then responds to them in different ways each time. Again this structure provides the listener with a sense of a grounded performance. It also shows that the CAM has lots of ideas and isn't just programmed to do the same thing in the same situation. i.e. this passage is a nice example of the system asserting musical agency\/autonomy.  "
}, {
	"id": "9111",
	"datetime": "2016-01-10 13:11:58",
	"PraiseUser_id": "790",
	"region_start": "171990.71286115443",
	"region_end": "209105.8114196568",
	"title": "There is a sense now of the performance coming to a close. The ending is so good is that genuine improvisation? Just like watching \"have I got news for you\" I ask myself what is improvised and what is scripted. Was this sequence of 8 repeated notes scripted? Its OK if it was because I could imagine it would be hard for the CAM to know when to end! Its really interesting again that there are laughs through this - and at the end - I didnt know this when I started writing these comments. i.e. I didnt listen to it all the way through first as I wanted to write about what I was experiencing but it is clear again that the audience felt a great deal of humour in this performance. But the end is really great as I listen again however you manage it. One single note on the sax. 8 repeated notes on the CAM and then they finish together. And finishing is often the hardest but about completely improvised performances. Enjoyed it a lot! "
}]